<?php

	return [
		'404'      => 'РЎС‚СЂР°РЅРёС†Р° РЅРµ РЅР°Р№РґРµРЅР°.',
		'auth'     => [
			'title'          => 'РђРІС‚РѕСЂРёР·Р°С†РёСЏ',
			'username'       => 'Р›РѕРіРёРЅ',
			'password'       => 'РџР°СЂРѕР»СЊ',
			'login'          => 'Р’РѕР№С‚Рё',
			'logout'         => 'Р’С‹Р№С‚Рё',
			'wrong-username' => 'РќРµРІРµСЂРЅС‹Р№ Р»РѕРіРёРЅ',
			'wrong-password' => 'РёР»Рё РїР°СЂРѕР»СЊ'
		],
		'ckeditor' => [
			'upload'        => [
				'success' => 'Р¤Р°Р№Р» Р±С‹Р» СѓСЃРїРµС€РЅРѕ Р·Р°РіСЂСѓР¶РµРЅ: \\n- Р Р°Р·РјРµСЂ: :size РєР± \\n- С€РёСЂРёРЅР°/РІС‹СЃРѕС‚Р°: :width x :height',
				'error'   => [
					'common'              => 'Р’РѕР·РЅРёРєР»Р° РѕС€РёР±РєР° РїСЂРё Р·Р°РіСЂСѓР·РєРµ С„Р°Р№Р»Р°.',
					'wrong_extension'     => 'Р¤Р°Р№Р» ":file" РёРјРµРµС‚ РЅРµРІРµСЂРЅС‹Р№ С‚РёРї.',
					'filesize_limit'      => 'РњР°РєСЃРёРјР°Р»СЊРЅС‹Р№ СЂР°Р·РјРµСЂ С„Р°Р№Р»Р° :size РєР±.',
					'imagesize_max_limit' => 'РЁРёСЂРёРЅР° x Р’С‹СЃРѕС‚Р° = :width x :height \\n РњР°РєСЃРёРјР°Р»СЊРЅС‹Р№ СЂР°Р·РјРµСЂ РёР·РѕР±СЂР°Р¶РµРЅРёРµ РґРѕР»Р¶РµРЅ Р±С‹С‚СЊ: :maxwidth x :maxheight',
					'imagesize_min_limit' => 'РЁРёСЂРёРЅР° x Р’С‹СЃРѕС‚Р° = :width x :height \\n РњРёРЅРёРјР°Р»СЊРЅС‹Р№ СЂР°Р·РјРµСЂ РёР·РѕР±СЂР°Р¶РµРЅРёРµ РґРѕР»Р¶РµРЅ Р±С‹С‚СЊ: :minwidth x :minheight',
				]
			],
			'image_browser' => [
				'title'    => 'Р’СЃС‚Р°РІРєР° РёР·РѕР±СЂР°Р¶РµРЅРёСЏ СЃ СЃРµСЂРІРµСЂР°',
				'subtitle' => 'Р’С‹Р±РµСЂРёС‚Рµ РёР·РѕР±СЂР°Р¶РµРЅРёРµ РґР»СЏ РІСЃС‚Р°РІРєРё',
			],
		],
		'table'    => [
			'new-entry'      => 'РќРѕРІР°СЏ Р·Р°РїРёСЃСЊ',
			'edit'           => 'Р РµРґР°РєС‚РёСЂРѕРІР°С‚СЊ',
			'delete'         => 'РЈРґР°Р»РёС‚СЊ',
			'delete-confirm' => 'Р’С‹ СѓРІРµСЂРµРЅС‹, С‡С‚Рѕ С…РѕС‚РёС‚Рµ СѓРґР°Р»РёС‚СЊ СЌС‚Сѓ Р·Р°РїРёСЃСЊ?',
			'delete-error'   => 'РќРµРІРѕР·РјРѕР¶РЅРѕ СѓРґР°Р»РёС‚СЊ СЌС‚Сѓ Р·Р°РїРёСЃСЊ. РќРµРѕР±С…РѕРґРёРјРѕ РїСЂРµРґРІР°СЂРёС‚РµР»СЊРЅРѕ СѓРґР°Р»РёС‚СЊ РІСЃРµ СЃРІСЏР·Р°РЅРЅС‹Рµ Р·Р°РїРёСЃРё.',
			'moveUp'         => 'РџРѕРґРІРёРЅСѓС‚СЊ РІРІРµСЂС…',
			'moveDown'       => 'РџРѕРґРІРёРЅСѓС‚СЊ РІРЅРёР·',
			'filter'         => 'РџРѕРєР°Р·Р°С‚СЊ РїРѕРґРѕР±РЅС‹Рµ Р·Р°РїРёСЃРё',
			'filter-goto'    => 'РџРµСЂРµР№С‚Рё',
			'save'           => 'РЎРѕС…СЂР°РЅРёС‚СЊ',
			'cancel'         => 'РћС‚РјРµРЅРёС‚СЊ',
			'download'       => 'РЎРєР°С‡Р°С‚СЊ',
			'all'            => 'Р’СЃРµ',
			'processing'     => '<i class="fa fa-5x fa-circle-o-notch fa-spin"></i>',
			'loadingRecords' => 'РџРѕРґРѕР¶РґРёС‚Рµ...',
			'lengthMenu'     => 'РћС‚РѕР±СЂР°Р¶Р°С‚СЊ _MENU_ Р·Р°РїРёСЃРµР№',
			'zeroRecords'    => 'РќРµ РЅР°Р№РґРµРЅРѕ РїРѕРґС…РѕРґСЏС‰РёС… Р·Р°РїРёСЃРµР№.',
			'info'           => 'Р—Р°РїРёСЃРё СЃ _START_ РїРѕ _END_ РёР· _TOTAL_',
			'infoEmpty'      => 'Р—Р°РїРёСЃРё СЃ 0 РїРѕ 0 РёР· 0',
			'infoFiltered'   => '(РѕС‚С„РёР»СЊС‚СЂРѕРІР°РЅРѕ РёР· _MAX_ Р·Р°РїРёСЃРµР№)',
			'infoThousands'  => '',
			'infoPostFix'    => '',
			'search'         => 'РџРѕРёСЃРє: ',
			'emptyTable'     => 'РќРµС‚ Р·Р°РїРёСЃРµР№',
			'paginate'       => [
				'first'    => '<i class="fa fa-angle-double-left"></i>',
				'previous' => '<i class="fa fa-angle-left"></i>',
				'next'     => '<i class="fa fa-angle-right"></i>',
				'last'     => '<i class="fa fa-angle-double-right"></i>'
			]
		],
		'select'   => [
			'nothing'  => 'РќРёС‡РµРіРѕ РЅРµ РІС‹Р±СЂР°РЅРѕ',
			'selected' => 'РІС‹Р±СЂР°РЅРѕ'
		]
	];